<script setup>
// import * as PDF from 'pdfjs-dist'
// import { useRoute } from 'vue-router'

// // 路径环境变量
// const PB_PATH = import.meta.env.VITE_APP_PUBLIC_PATH
// PDF.GlobalWorkerOptions.workerSrc = `${PB_PATH}pdf.worker.js`
// let pdfDoc = null
// const pdfPages = ref(0)
// // const pdfScale = ref(0.63)

// function renderPdf(num = 1) {
//   pdfDoc.getPage(num).then((page) => {
//     const canvas = document.getElementById(`pdf-canvas-${num}`)
//     const ctx = canvas.getContext('2d')
//     const viewport = page.getViewport({ scale: 1 })
//     // 画布大小
//     canvas.height = viewport.height
//     canvas.width = viewport.width
//     // 画布的dom大小, 设置移动端,宽度设置铺满整个屏幕
//     const clientWidth = document.body.clientWidth
//     canvas.style.width = `${clientWidth}px`
//     // 根据pdf每页的宽高比例设置canvas的高度
//     canvas.style.height = `${clientWidth * (viewport.height / viewport.width)}px`
//     page.render({
//       canvasContext: ctx,
//       viewport,
//     })
//     if (num < pdfPages.value) {
//       renderPdf(num + 1)
//     }
//   })
// }
// async function resolvePdf(url) {
//   const loadingTask = PDF.getDocument({
//     url,
//     cMapUrl: '/cmaps/',
//     cMapPacked: true,
//   })
//   loadingTask.promise.then((pdf) => {
//     pdfDoc = pdf
//     pdfPages.value = pdf.numPages
//     nextTick(() => {
//       renderPdf()
//     })
//   })
// }

// onMounted(() => {
//   nextTick(() => {
//     const filePath = `${PB_PATH}pdfs/serve.pdf`
//     resolvePdf(filePath)
//   })
// })
</script>

<template>
  <div id="pdfRef" class="pdf-container">
    <!-- <canvas v-for="pageIndex in pdfPages" :id="`pdf-canvas-${pageIndex}`" :key="pageIndex" class="canvas-x" /> -->
    <article>
      <section>
        <h2>用户注册及居间服务协议</h2>
        <pre>
·
感谢您使用本公司的服务！
本公司运营并管理的互联网信息发布及推广平台，下述本公司的表述，既包括指代本公司的服务，也包括指代本公司服务的提供者。“用户”是指使用本公司的相关服务的使用人，在本协议中更多地称为“您”或“用户”。
用户注册服务协议
本注册服务协议系辽宁尚士华融法律咨询服务有限公司（以下简称【本公司】）通用注册服务协议，在使用本公司提供的服务之前，请您务必审慎阅读、充分理解《【本公司】服务协议》（以下简称“本协议”），特别是“特别提示”条款、限制或免除责任的相应条款、法律适用和争议解决条款等以加黑和/或加下划线形式提示您的部分。
【本公司】不向未成年人或无完全民事行为能力人提供服务，请您确保您已满十八周岁并具有完全民事行为能力。若您在注册登录或使用“本公司网站”时勾选本协议即表示您确认对本协议全部条款含义已充分理解、完全接受。您下载、注册登录、使用“本公司”网站功能即视为您已知悉并同意接受本协议项下所有条款内容。
·
特别提示：
■ 您知晓：【本公司】仅作为信息提供平台。除非有特定说明，您在使用本平台时我们为您匹配到的金融服务或产品，包括但不限于贷款咨询、贷款代办、认证、授信风控、贷款、贷后管理（催收）等，均是由您与该金融信息服务商或金融产品服务商（以下或称“合作机构”）产生独立的合同关系，本平台并非相应法律关系中的一方主体。
■ 您知晓：当您在平台完成注册后，平台会根据您的借款金额为您匹配不同的合作机构。如为您匹配的合作机构为金融产品服务商的，平台会根据《隐私政策》规定将您的手机号码加密后传送给金融产品服务商。金融产品服务商验证通过后，平台将跳转到金融产品服务商的页面，您可进行注册并申请借款。如为您匹配的机构为金融信息服务商的，平台会根据《隐私政策》规定先将您的手机号码加密后传送给金融信息服务商。金融信息服务商验证通过后，平台再根据金融信息服务商的要求将您的相关信息（具体信息类型以《承诺书》为准）传送给金融信息服务商。
平台提示您注意：当您接受特定合作机构提供的服务时，根据不同合作机构的要求，您可能还需要向其提供必要的个人信息，在此之前请您务必仔细阅读合作机构制定的关于借款、个人信息收集使用协议或称《隐私条款》、 规则（具体名称以合作机构页面显示的为准，在此合称为“合作机构规则”，如有）。对您未能阅读该类合作机构规则而造成的与合作机构的争议，由您和合作机构自行处理，
【本公司】不承担任何责任。
■ 您知晓：根据您选择的特定合作机构的服务，若需要【本公司】将您的信息代为提交至特定合作机构，【本公司】将明确征得您的授权及同意，【本公司】代为提交后，该部分信息将受到您已同合作机构达成的《隐私条款》的约束，因合作机构未能履行《隐私条款》而造成的对您的违约责任，由合作机构全部承担，与【本公司】无关。■ 您知晓：【本公司】仅提供互联网信息服务，若因您选择的特定合作机构违反我国现行法律法规而给您造成的损失，除法律法规有明确规定外，【本公司】不承担任何赔偿责任，届时【本公司】将尽可能协助您与该合作机构进行沟通处理。
■ 您同意：【本公司】有权在必要时修改本协议条款并按法律规定公示，您可以在相关服务页面查阅最新版本的协议条款。本协议条款变更后，如果您继续使用【本公司】提供的服务，即视为已接受修改后的协议。如果您不接受修改后的协议，您有权停止使用【本公司】提供的服务。
■ 【本公司】温馨提示您：合理负债，理性借款。
·
第一条协议的范围
·
1. 本协议是您与【本公司】服务的提供者之间关于您登录、使用【本公司】服务（包括但不限于 PC 端、移动端设备等方式登陆并使用【本公司】服务）所订立的协议。
2. 除本协议外，【本公司】也将发布《隐私政策》，供您在注册或使用时点击同意，敬请您仔细审慎阅读。
3. 您了解并同意，由于互联网业务极速变化迭代的特性，本协议可能无法涵盖当前或未来可能发生的所有情况，为此【本公司】有必要通过新增协议、规则等形式不断完善本协议内容，以便更加明确您与【本公司】间的权利义务关系，因此本协议将包括【本公司】已经制定的或未来可能制定和发布的协议、规则，此相关协议、规则均为本协议不可分割的一部分。
·
第二条服务的内容
·
本协议所指服务是贷款信息服务，即由本公司根据您提交的贷款需求申请及个人信息，为您推荐匹配的贷款产品或将您提交的申请推荐给可能为您提供具体服务的合作机构。具体服务内容由我们根据实际情况提供并不时更新，包括但不限于信息、图片、文章、评论、链接等，本公司将定期或不定期根据用户的意愿以电子邮件、短信、电话等方式为用户提供活动信息，并向用户提供相应服务。本公司对提供的服务拥有最终解释权。
·
第三条登录账号使用规则
·
一、用户注册及信息提供
1. 您在注册或使用【本公司】服务时可能需要提供一些必要的信息（如手机号码等）。此时，您会收取一个验证码。为安全起见，您不得将验证码透露他人。同时，您须保证所填写及所提供的资料真实、准确、完整，否则无法使用本服务或在使用过程中受到限制。对于因您提供的信息不真实、不准确或不完整导致的责任和损失由您承担。
2. 【本公司】有权根据您所提供资料的真实性、准确性、完整性以及是否符合【本公司】规定的其他条件，决定是否为您提供服务。
3. 您注册成功后，【本公司】将为您配置账号。用户的账号仅供用户本人使用，账号信息和权限不得以转让、赠与、借用、售卖、授权或租用等方式许可给第三方使用或和第三方共同控制、使用。
4. 本公司特别提醒您应妥善保管您的账号及密码，如因您保管不善导致盗号或密码失窃的，责任由您自行承担。
5. 您在使用本公司服务过程中，所提供的信息发生变动，应及时进行变更。
6. 未成年人或非完全民事行为人使用本服务所产生的法律义务或所造成的法律
风险，均由其监护人履行或承担。
7. 为方便为您提供服务，您在申请贷款时需填写相关个人信息并授权委托【本公司】可以根据《隐私政策》规定将您在【本公司】填写的信息提交给合作机构，以便我们能为您匹配合适的机构，提高服务效率。在接受服务的过程中，您除遵守本协议约定外，还应遵守合作机构的规则。
8. 【本公司】为用户提供综合信息服务，为客户体验及功能服务考虑，您在使用不同服务时被要求填写的信息可能不完全一致。
二、登录账号和登录凭证安全
1. 您须妥善保管本人的登录账号和登录凭证，凡使用【本公司】登录账号和登录凭证的行为，【本公司】视为您本人的操作，操作所产生的电子信息记录均为【本公司】用户行为的有效凭据。您对利用该登录账号和登录凭证所进行的一切活动负全部责任。
2. 您应按照机密的原则保管登录账号和登录凭证，包括但不限于：
（1）不应在网吧等公众场所或他人的电脑或网络设备上使用【本公司】及相关金融产品/服务提供平台；
（2）若遇有账号异常现象，您应当第一时间联系我们处理。
·
第四条用户的禁止行为
·
一、您使用本公司服务时，禁止从事以下行为，本公司的系统记录可作为实施该行为的证据：
1.发布、传送、传播、储存危害国家安全统一、破坏社会稳定、违反公序良俗、侮辱、诽谤、淫秽、暴力以及任何违反国家法律法规的内容；
2.发布、传送、传播、储存侵害他人知识产权、商业秘密等合法权利的内容；
3.恶意虚构事实、隐瞒真相以误导、欺骗他人；
4.发布、传送、传播广告信息及垃圾信息；
5.将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序等资料，加以上载、张贴、发送电子邮件或以其他方式传送；
6.恶意登陆、注册，恶意使用系统功能及服务；干扰或破坏【本公司】服务或与【本公司】服务相连的服务器和网络，或不遵守【本公司】服务网络使用的规定；
7.恶意诋毁或损害【本公司】声誉、利用【本公司】用户身份从事违反国家法律法规活动等行为；
8.违反任何相关的中国法律、行政法规、规章、条例等其他具有法律效力的规范。
二、如果【本公司】发现或收到他人举报您发布的信息违反本条约定，【本公司】有权进行独立判断并采取技术手段予以删除、屏蔽或断开链接。同时，【本公司】有权视用户的行为性质，采取包括但不限于暂停或终止服务，限制、冻结或终止账号使用等措施并追究您的相应法律责任。
·
第五条服务的变更、中断或终止
·
一、您理解：【本公司】需要定期或不定期地对提供服务的平台（如互联网网站、移动网络等）或相关的设备进行检修或者维护，或对【本公司】用户系统进行升级、改造。如因此类情况而造成服务在合理时间内的中断，【本公司】无需为此承担任何责任。但【本公司】应尽可能事先进行通告并根据情况在相应服务页面提前作出通知。
二、如发生下列任何一种情形，【本公司】有权对您采取暂停或终止服务，限制、冻结或终止账号使用等措施而无需对您或任何第三方承担任何责任：
1.根据法律规定您应提交真实信息，而您提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；
2.您违反相关法律法规或本协议的约定；
3.按照法律规定或主管部门的要求；
4.出于安全的原因或其他必要的情形。
三、您有责任自行备份存储在本服务中的数据。如果您的服务被终止，【本公司】可以从服务器上永久地删除您的数据，但法律法规另有规定的除外。服务终止后【本公司】没有义务向您返还数据。
·
第六条授权条款
·
一、您同意：除法律法规另有规定之外，本人授权【本公司】将本人提供给我们的信息、享受【本公司】服务产生的信息（包括本协议签署之前提供和产生的信息）以及【本公司】根据本条约定查询、收集的信息，用于【本公司】及其因服务必要委托的合作机构为本人提供服务、推荐产品、开展市场调查与信息数据分析等。
二、除法律另有规定之外，本人授权本公司基于为本人提供更优质服务和产品的目的，从【本公司】因服务必要开展合作的伙伴处获取、查询、收集本人的信息。为确保本人信息的安全，【本公司】及其合作伙伴对上述信息各自负有保密义务，并采取各种技术措施保证信息安全。
三、本条款自本协议签署时生效，具有独立法律效力，不受协议成立与否及效力状态变化的影响。如您不同意上述授权条款的部分或全部，可按照【本公司】的指引取消或变更授权。
·
第七条免责条款
·
您理解并同意，【本公司】在以下情况（包括但不限于）下不承担责任，为清楚查阅考虑，本免责条款不全部设置为加黑加下划线的方式提示，但敬请全部查阅：
一、【本公司】不对本服务提供任何形式的保证，包括但不限于本服务符合您的需求，本服务不受干扰、及时提 供或免于出错。
二、【本公司】的合作机构所提供的服务内容及品质由该合作机构自行负责。
三、【本公司】不保证为向用户提供便利而设置的外部链接的准确性和完整性，同时对于该等外部链接指向的不由【本公司】实际控制的任何网页上的内容，【本公司】不承担任何责任。
四、对于因本协议第四条原因或相关的系统故障所造成的服务变更、中断或终止，【本公司】不承担责任。
五、因以下情况没有正确执行您提交的【本公司】用户操作指令而造成损失的，【本公司】不承担任何责任：
1.指令信息不明、存在乱码或不完整等；
2.您所拥有的产品或服务发生失效、终止等情况；
3.其他本公司无过失的情况。
六、对于受到计算机病毒、木马或其他恶意程序、黑客攻击所造成的损失。
七、您须安全使用【本公司】产品功能，妥善保存【本公司】的登录账号、登录凭证，对您保管不善造成的损失【本公司】不承担责任。
八、如果您在共享环境下或在电脑被远程监控的情况下登陆【本公司】，由此造成的损失【本公司】不承担责任。
九、【本公司】不允许您使用他人身份信息注册，否则，因此产生的法律责任将由您本人承担，给他人造成损失的，您应给予赔偿。
十、如您使用他人登录账号，须事先获得他人书面同意。一旦输入正确的登录账号和登录凭证，【本公司】即视您为已获得他人同意。您与他人之间因此产生的任何纠纷与【本公司】无关，对您或他人的损失【本公司】不承担责任，如您的以上行为造成【本公司】损失的，【本公司】将保留追索的权利。
十一、如果使用本公司服务的用户将登录账号项下详细信息输入其他任何服务系统而不是输入【本公司】相关网页安全登陆系统，由此造成的损失【本公司】不承担责任。
十二、使用本公司服务的用户通过移动通讯设备登陆相关网站和使用相关服务，因通讯过程中导致信息的不完整、丢失或被第三方拦截等不可归责于【本公司】的情形，【本公司】不承担责任。
十三、因无法预见、无法避免且无法克服的不可抗力事件，导致【本公司】在本协议项下的义务无法履行或无法按时履行，【本公司】在法律允许的范围内免责。
十四、如果【本公司】存在投入使用时的科学技术水平尚不能发现的缺陷，由此造成的损失【本公司】不承担责任。
·
第八条知识产权声明
·
一、【本公司】在本服务中所包含的内容（包括但不限于网页、文字、图片、音频、视频、图表等）及提供本服 务时所依托软件的著作权、专利权及其他知识产权均归【本公司】及关联公司所有。【本公司】在本服务中所使用的“【本公司】”等商业标识，其商标权和相关权利归【本公司】所有。
二、本服务包含的内容的知识产权均受到法律保护，您若侵犯【本公司】相关知识产权将承担损害赔偿责任。
·
第九条隐私权保护规则
·
【本公司】承诺采取严格的隐私政策，尊重并保护用户隐私。【本公司】将按照另行制定的《隐私政策》等收集、使用及共享您的个人信息。《隐私政策》包含了本公司收集、存储、保护、使用和共享您的个人信息的条款，建议您完整地阅读《隐私政策》，以帮助您了解维护自己隐私权的方式。
·
第十条【本公司】平台服务
·
如果您登陆并使用【本公司】平台提供的服务时，您还应同意并遵守以下服务及相关协议内容：
一、除非特殊说明，【本公司】所展示的贷款产品均由合作机构向您提供，由其承担相关责任。【本公司】会督促合作机构尽可能准确、详尽地描述每件产品信息。然而，鉴于技术能力有限，【本公司】不能完全逐一审查所有商品或服务的相关内容是准确、可靠，如您发现任何错误，请及时与【本公司】或合作机构联系。
二、您同意在接受【本公司】提供服务的同时，允许【本公司】在遵守法律法规的前提下自行或由合作机构向您发送、展示广告、推广或宣传信息（包括商业与非商业信息）。如您对发送、推荐的广告或信息不感兴趣，您可以基于【本公司】提供的相关技术选项，控制系统向您展示或不展示/减少展示相关类型的广告或信息。
·
第十一条法律效力
·
一、您使用本公司的服务即视为您已阅读本协议并接受本协议的约束。
二、本协议所有条款的标题仅为阅读方便，本身并无实际含义，不能作为本协议含义解释的依据。
三、本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。
·
第十二条法律适用和争议解决
·
一、本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不含冲突法），如无相关法律规定的，则应参照通用国际商业惯例和/或行业惯例。
二、您与【本公司】在履行本协议的过程中，如发生争议，应协商解决。协商不成的，均可向沈阳市铁西区法院提起诉讼。
        </pre>
      </section>
      <section>
        <h2>借款居间服务协议</h2>
        <pre>
          甲方:申请人
乙方:辽宁尚士华融法律咨询服务有限公司
1.乙方是一家总部设立在辽宁省沈阳市合法成立并有效存续的有限责任公司，从事商务咨询、居间助贷等服务平台，公司与金融贷款机构和银行有深度的渠道合作，并能有效提供贷款融资居间撮合、管理、咨询等服务。
2.以上双方本着实事求是、平等互利、共同发展的原则，就乙方为甲方提供融资居间服务等事宜，经过友好协商，达成协议如下:
第一条 委托内容
1.甲方缺乏流动资金，乙方能够提供融资借款相关信息咨询服务并协助甲方完成融资借款，甲方现委托乙方寻找、介绍出资方，协助甲方完成融资，乙方同意接受委托，双方签订正式合同，并严格履行，以达到双方目的
第二条 居间人权利义务
1.乙方在履行本合同的过程中，可以向第三方表明其为甲方的居间人，并可以向第三方介绍甲方融资项目的相关情况。
2.乙方应认真完成甲方的委托事项，积极为甲方寻求机会，并为甲方与相关对方当事人签署合同或协议提供联络、协助、撮合等服务。
3.乙方在代理甲方的委托事项过程中，因甲方过错造成其损失时，乙方有权要求甲方承担赔偿表任。
4.乙方有权收集、使用甲方的各项身份及资格信息用于中介服务事项。
第三条 借款人的权利义务
1.甲方应按乙方的要求提供相关资料，确保所提供资料是真实、完整、有效的,并授权乙方使用其个人及经营信息用于居间服务事项.
2.甲方严格按照本合同约定向乙方支付合同费用，若甲方违约，每逾期一日按未支付款项的千分之二向乙方支付违约金，因甲方过错造成乙方损失的，甲方应承担乙方为此支付的所有费用，包括但不限于乙方为处理纠纷支付的诉讼费、保全费、律师费、执行费、差旅费等所有费用。
第四条 甲方需承担的费用
若乙方促成有出资意向的第三方与甲方签署借款合同，甲方应向乙方支付融资额度的约定金额 X%(具体比率以甲方与乙方技术员文字聊天约定为准)作为乙方酬金，甲方应于放款之日一次性支付酬金。
第五条特别条款
1.甲方认可乙方提供的根据实际情况填写本网站内容，自愿申请注册成为本网站的用户，并认可和遵守网站的经营模式及交易规则，同意和接受乙方制定《借款居间服务协议》及在网站公布的所有条款和其他规则声明等，该规则和声明是本合司的附件，与本合同具有同等法律效力；规则和条款与本合同不一致的，则以本合同为准。
2.甲方确认，乙方仅系促成甲方与出借方达成借款交易的网络交易服务中间平台，并为甲方借款融资事项提供中介咨询服务，甲方和出借人进行交易的一切法律后果均由各方自行承担，与乙方无关，乙方对此不承担任何法律责任。第六条 争议的解决
1.本协议适用中华人民共和国法律和法规。因本协议发生纠纷，任何一方可向乙方所在地管辖人民法院提出诉讼。
第七条 协议的生效及其他
1.本合同通过网站正常操作后，自动生成电子合同，为合同双方同意和认可。自动生成的电子合同文本为双方真实意思表示，对各方均具有法律约束力。电子合同与当事人签署的纸质合同具有同等法律效力。

        </pre>
      </section>
    </article>
  </div>
</template>

<style lang="less" scoped>
.pdf-container {
  width: 100%;
  height: 100%;
  .canvas-x {
    border: 1px solid #ddd;
  }
}

.img-wrapper {
  width: 222px;
  height: 80px;
  display: none;
  background: rgba(230, 54, 51, 0.2);

  .sign-picture {
    width: 222px;
    height: 80px;
  }
}
body {
  font-family: Arial, sans-serif;
  line-height: 1.6;
  margin: 0;
  padding: 0 16px;
  background-color: #f9f9f9;
  color: #333;
}

article {
  max-width: 800px;
  margin: 20px auto;
  padding: 20px;
  background: #fff;
  box-shadow: 0 2px 4px rgba(0, 0, 0, 0.1);
  border-radius: 8px;
}

h1 {
  font-size: 16px;
  text-align: left;
  margin-bottom: 20px;
}

h2 {
  font-size: 16px;
  margin-top: 20px;
  color: #555;
}

pre {
  margin-bottom: 16px;
  text-align: justify;
  white-space: pre-line;
}

footer {
  text-align: center;
  font-size: 8px;
  color: #777;
  p {
    font-size: 16px;
    text-align: right;
  }
}
</style>

<route lang="json">
{
    "name": "serveFile"
}
</route>
