<script setup>
// import * as PDF from 'pdfjs-dist'

// // 路径环境变量
// const PB_PATH = import.meta.env.VITE_APP_PUBLIC_PATH
// PDF.GlobalWorkerOptions.workerSrc = `${PB_PATH}pdf.worker.js`
// let pdfDoc = null
// const pdfPages = ref(0)
// const pdfScale = ref(0.63)

// function renderPdf(num = 1) {
//   pdfDoc.getPage(num).then((page) => {
//     const canvas = document.getElementById(`pdf-canvas-${num}`)
//     const ctx = canvas.getContext('2d')
//     const viewport = page.getViewport({ scale: 1 })
//     // 画布大小
//     canvas.height = viewport.height
//     canvas.width = viewport.width
//     // 画布的dom大小, 设置移动端,宽度设置铺满整个屏幕
//     const clientWidth = document.body.clientWidth
//     canvas.style.width = `${clientWidth}px`
//     // 根据pdf每页的宽高比例设置canvas的高度
//     canvas.style.height = `${clientWidth * (viewport.height / viewport.width)}px`
//     page.render({
//       canvasContext: ctx,
//       viewport,
//     })
//     if (num < pdfPages.value) {
//       renderPdf(num + 1)
//     }
//   })
// }
// async function resolvePdf(url) {
//   const loadingTask = PDF.getDocument({
//     url,
//     cMapUrl: '/cmaps/',
//     cMapPacked: true,
//   })
//   loadingTask.promise.then((pdf) => {
//     pdfDoc = pdf
//     pdfPages.value = pdf.numPages
//     nextTick(() => {
//       renderPdf()
//     })
//   })
// }

onMounted(() => {
  nextTick(() => {
    // const filePath = `${PB_PATH}pdfs/self.pdf`
    // resolvePdf(filePath)
  })
})
</script>

<template>
  <div id="pdfRef" class="pdf-container">
    <article>
      <header>
        <h1>隐私政策</h1>
        <pre>
          我们尊重并保护用户（以下或称“您”）的隐私。鉴于此，我们根据相关法律法规规定，制定了本隐私政策，以帮助您了解我们将如何收集、存储、使用、保护及对外提供您的个人信息。同时，我们会通过本政策向您说明，我们如何为您提供访问、更新、管理和保护您的信息的服务。
本政策与您使用我们的服务关系紧密，请您在使用本产品之前认真阅读并确认充分理解本政策，以便您做出适当的选择。我们尽力用通俗易懂、简明扼要的语言文字表达本政策，并对本政策中与您的权益存在重大关系的条款和个人敏感信息以及对我们具有或可能具有免责或限制责任的条款，采用粗体字、下划线等方式标注以提示您注意。如您使用本产品，即意味着您已阅读本政策的所有条款，并且同意我们按照本政策收集、使用、保护并对外提供您的个人信息。如您不同意本政策的部分或全部内容、或对本政策内容有任何疑问，您有权立即停止使用本产品，并与我们联系（联系方式详见文末）。
        </pre>
      </header>
      <section>
        <h2>一、我们如何收集和使用您的个人信息</h2>
        <pre>
          在您使用本公司的服务的过程中，我们需要收集您的一些个人信息，用以向您提
供服务、提升我们的服务质量。
个人信息是指以电子或其他方式记录的能够单独或者与其他信息结合识别特定自然人身份的各种信息。而对于本政策中列明的个人敏感信息，为便于您在阅读时有所警觉，我们会在本隐私政策中以字体加粗、加下划线，或单独指出等标注方式提示您注意。
当您使用本产品时，我们将在如下具体产品或者服务场景中，基于实现该场景所需的目的收集您的个人信息。您并非必须向我们提供个人信息，但如果您选择不提供，我们可能无法为您提供相应的服务（特别是基于以下所明确的核心业务功能时，若您拒绝我们收集该核心业务功能下所必须的信息，则您无法使用该服务），或者无法回应或解决您所遇到的问题。
1.1 当您注册成为我们的用户时，您需要提供您的手机号码，并在获取验证码后输入验证码完成登录。
1.2 如您希望通过我们向金融信息服务商或金融产品服务商申请该服务商的借贷产品／服务（核心业务功能），为便于完成贷款人身份识别、信用审核、借款额度评估等，您需要按照提示在我们网站上提供您的基本信息（姓名、身份证、手机、性别、年龄、所在城市）以及补充信息（包括房产情况、车辆情况、职业类别、工作单位情况、工资发放形式、社保缴纳情况、公积金缴纳情况、企业纳税情况、企业流水情况、商业保险情况、信用卡情况、微粒贷情况），并提供贷款金额、贷款用途、贷款期限、还款方式等信息。
1.3 为便于向您提供客服及留言反馈功能，您需要填写并提交问题的描述、邮箱和手机号码信息，以便于我们与您联系、尽快帮助您解决问题或记录相关问题的处理方案及结果。
1.4 为核实您提交的信息、资料是否准确、充分，以尽可能避免因他人冒用您的身份给您造成不必要的损失，您同意并授权我们可以自行或通过第三方合作机构（征信机构、金融机构）对您提交或我们搜集的用户信息（例如您的个人身份证信息等）进行核实、验证，例如对设备、网络环境分析，采用手机短信校验码等多项信息交叉校验等方式验证，并对获得的核实、验证结果进行查看、收集、使用和留存等操作。
1.5 为向您提供更便捷、更优质、个性化的产品及/或服务，努力提升您的体我们在向您提供的以下附加服务中可能会收集和使用您的个人信息。如果您不提供这些信息，不会影响您使用核心业务功能，但您可能无法获得这些附加服务给您带来的用户体验。这些附加服务包括：基于位置信息的个性化推荐服务。指您开启设备定位功能并使用我们基于位置提供的相关服务时，收集的有关您位置的信息。我们可能在您使用本产品的过程中收集您的位置信息，以便您基于所在地点位置接受个性化服务推荐，我们还将收集您个人常用设备信息（包括设备名称、设备型号、设备识别码、操作系统和应用程序版本）和日志信息（如访问内容、IP 地址、访问日期和时间及访问记录等），收集这些信息是为了向您提供更好的产品和／或服务并改善用户体验。同时，这些信息可帮助我们更好地保护您的登录账号安全。除基于安全目的以外的业务外，您有权选择拒绝提供该位置信息。请您注意，您开启以上权限即代表您授权我们可以收集和使用相关个人信息来为您提供对应服务，您一旦关闭以上权限即代表您取消了授权，我们将不再基于对应权限继续收集和使用相关个人信息，也无法为您提供该权限所对应的服务。但是，您关闭权限的决定不会影响此前基于您的授权所进行的信息收集及使用。
1.6 您在此同意并授权，我们可以直接将您的个人信息和资料用于如下用途（特定业务功能所对应收集的信息请见上文）：
(1) 根据您的申请信息及需求信息等，为您匹配合适的金融信息服务商或金融产品服务商（以下称“合作机构”。我们将不定期更新相关合作机构），向合作机构反馈您的需求信息，以帮助您获得相关服务。并在符合相关条件时，为您提供免费增值服务，以提高您从指定合作机构获得服务的机会。
(2)在我们向您提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；
(3)为向您提供适合于您的服务，并持续维护、改善、优化该等服务，对您的信息进行内部归类、模型建设和分析等内部使用；
(4)使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、位置设定、个性化的帮助服务和指示，或对您和其他用户作出其他方面的回应；
(5)用于预防、发现、调查欺诈、危害安全、非法或违反与我们或我们关联方协议、政策或规则的行为，以保护您、我们的其他客户、我们或我们关联方的合法权益；
(6)为了让您参与有关我们产品或服务的调查，使您了解我们的产品/服务的具体情况以及为了向您提供更好的服务，您同意我们可以通过电子邮件、手机短信或其他方式向您发送相关新闻和服务信息、为您提供有关优惠及推荐产品等。如您拒绝接受相关通知和信息，届时您可按照提示进行退订操作；
(7)为实现本隐私政策目的所需的、或者本隐私政策或其他协议中经您授权许可的其他使用方式。
1.7 根据相关法律法规，在以下情形中，我们收集、使用个人信息无需征得您的授权或同意：
（1）与国家安全、国防安全直接相关的；
（2）与公共安全、公共卫生、重大公共利益直接相关的；
（3）与犯罪侦查、起诉、审判和判决执行等直接相关的；
（4）出于维护您或他人的生命、财产等重大合法权益目的但又很难得到您本人同意的；
（5）所收集的个人信息是您自行向社会公众公开的；（6）从合法公开披露的信息中收集个人信息，例如：合法的新闻报道、政府信息公开等渠道；
（7）根据您的要求签订和履行合同所必需的；
（8）用于维护所提供的服务的安全稳定运行所必需的，例如：发现、处置产品或服务的故障；
（9）法律法规规定的其他情形。
1.8 您知晓并同意，在收集您的个人信息后，我们可能会通过技术手段对您的个人信息进行脱敏。我们有权在不透露您个人信息的前提下使用已经脱敏的信息。
1.9 为了了解您的偏好、进行数据分析、改善产品服务及用户体验，及时发现并防范安全风险，为用户和合作方提供更好的服务，您同意我们有权使用诸如“Cookie”等搜集、追踪相关信息和资料。我们不会将“Cookie”用于本隐私政策所述目的之外的任何用途，同时您可以根据自己的偏好留存或删除“Cookie”。
        </pre>
      </section>
      <section>
        <h2>二、我们如何共享、转让、公开披露您的个人信息</h2>
        <pre>2.1 信息共享
除本政策及法律法规、监管政策另有要求外，我们仅在特定情形下与我们的关联公司、供应商或合作机构共享您的信息。我们的供应商包括提供技术服务、电信服务、客户服务及辅助验证服务、审计服务、法律服务的机构；合作机构包括金融信息服务商或金融产品服务商（以下将我们的关联公司、供应商及合作机构合称“第三 方”）。
在和第三方合作需共享您的信息前，我们会尽商业上的合理努力对该第三方的安全能力进行检测，评估其采集信息的正当性、合法性和必要性，尽商业上的合理努力督促第三方在使用您的个人信息时遵守法律法规及合作协议中约定的保密和安全措施，并且禁止用于合作协议约定外的任何其他用途。一经发现其违反协议约定将会采取有效措施乃至终止合作。该等情形包括：
（1）为了向您提供或推荐服务、产品，或为了向您提供更完善的服务、产品，我们会与关联公司共享您的信息；
（2）我们与第三方共同进行推广活动，在推广活动中所收集的全部或部分个人信息可能会与该第三方分享；
（3）与需要获得此类信息以开展相关合作的供应商、顾问或其他服务提供商，例如第三方技术平台和帮助我们提供技术或分析的服务的供应商，以便帮助我们了解用户与服务之间的互动；
（4）在获取您同意的情况下与我们的供应商及合作机构共享您的信息；
（5）在您违反有关法律法规、本协议、您与我们合作的第三方签署的相关协议时，向您的交易对手、我们的关联公司或合作机构等第三方提供，包括但不限于用于催收、诉讼等；
（6）只有共享您的信息，才能提供您需要的服务。某些服务需由合作机构（包括但不限于提供相关技术支持的公司、顾问或其他金融信息服务提供商）提供或共同提供，为了向您提供此类服务，您同意我们向第三方提供完成服务所必要的个人信息和数据。这些必要的个人信息包括您的基本信息（姓名、性别、身份证、居住城市、房产情况、车辆情况、社保公积金缴纳情况、商业保险购买情况、工资发放形式、职业情况、信用卡及微粒贷申请情况），并提供贷款用途、贷款期限、还款方式信息。
（7）在法律法规要求或允许的范围内，保护我们、我们的其他用户、我们的关联公司的合法权益、财产或安全免遭不当损害；
（8）根据法律法规及合理商业习惯，在我们计划与其他公司合并、被其他公司收购或进行其他资本市场活动（包括但不限于 IPO、债券发行等），并因此需要接受来自其他主体的尽职调查时，我们会把您的信息提供给必要的主体，但我们会通过和这些主体签署保密协议等方式要求其对您的个人信息采取合理必要的保密措施；
（9）为遵守适用的法律法规及监管规定或维护社会公共利益之目的。
2.2 除以下情形外，我们不会将您的个人信息转让给任何公司、组织和个人：
（1）事先获得您的明确同意或授权；
（2）我们认为您在本平台的行为不符合我们服务协议或政策的规定，或我们认为需要维护本公司的权利或保护本公司财产的安全；
（3）在涉及合并、收购或破产清算等事件时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司或组织继续受本政策的约束，否则我们将要求该公司或组织重新向您征求授权或同意。
2.3 我们将会在以下情况下公开披露您的个人信息：
（1）根据您的需求，在您明确同意的披露方式下披露您所指定的个人信息；
（2）根据法律法规的要求、强制性的行政执法或司法要求必须提供您个人信息的情况下，我们将会依据所要求的个人信息类型和披露方式公开披露您的个人信息。
2.4 信息的限制使用
如您不希望我们获取您的日志信息或位置信息，您可以通过关闭浏览器 cookies功能或关闭设备定位功能的方式实现。
2.5 第三方管理
鉴于【本公司】并非实际的贷款产品提供者，而仅作为信息平台，当您在【本公司】提供的页面填写完必要信息，并实现页面跳转之后，您将直接和金融信息服务商或金融产品服务商或贷款产品建立法律关系，在该类第三方页面上，您须按照第三方的隐私政策要求独立提交您的个人信息，和【本公司】无关。
若您和该类第三方发生争议，您可以向【本公司】提出举报或投诉，我们将及时
协助处理。</pre>
      </section>
      <section>
        <h2>三、我们如何保护和存储个人信息</h2>
        <pre>3.1 您的个人信息存储于中国境内的服务器上，为了安全及备份的需要，我们可能将您的信息和资料储存到我们具备相应安全措施的公司的服务器上。
3.2 我们只会在达成本政策所述目的所需的最小期限内保留您的个人信息，除非法律有强制的存留要求。在确定该等最小期限时，我们会基于如下一些期限标准进行判断：
（1）完成与您相关的交易目的、维护相应交易及业务记录、应对您可能的查询或投诉；
（2）保证我们为您提供服务的安全和质量；
（3）您另行授权同意的期限；
（4）可能存在的国家法律规范强制保存的期限要求。 在您的个人信息超出保留期限后，我们会根据适用法律的要求删除您的个人信息，或使其匿名化处理。
3.3 为保障您的信息安全，我们将采取各种合理的物理、电子和管理等方面的安全措施来保护您的信息，使您的信息不会被泄漏、毁损或者丢失，包括但不限于SSL、信息加密存储、数据中心的访问控制、专用的网络通道及代理。我们对可能接触到您的信息的员工也采取了严格管理，包括但不限于根据岗位的不同采取不同的权限控制，与他们签署保密协议，监控相关操作情况等措施。【本公司】会按现有技术提供相应的安全措施来保护您的信息，提供合理的安全保障，我们将在任何时候尽力做到使您的信息不被泄漏、毁损或丢失。</pre>
      </section>
      <section>
        <h2>四、您如何访问和管理自己的个人信息</h2>
        <pre>4.1 个人信息删除。
为保护您的个人信息，您在我们平台填写的认证信息我们将会保存。另外，符合以下情形，您有权向我们提出删除个人信息的请求：
（1）如果我们违反法律法规规定，收集、使用个人信息的；
（2）如果我们违反与您之间的约定，收集、使用个人信息的；
（3）您主动注销了账号的（或实现匿名化处理）；
（4）我们违反法律法规规定或违反与您的约定向第三方共享、转让个人信息，且您要求删除的，我们将立即停止共享、转让的行为，并通知第三方及时删除（除非法律法规另有规定，或这些主体已独立获得您的授权）；
（5）我们违反法律法规规定或违反与您的约定，公开披露个人信息，且您要求删除的，我们将立即停止公开披露的行为，并发布通知要求相关接收方删除相应的信息（除非法律法规另有规定，或这些主体已独立获得您的授权）。
4.2 用户账户注销。
如您需注销您在我们平台上注册的账户，您可以与我们联系注销账户。为了向您提供更加便捷的注销方式，我们后续会不断优化我们的产品，并且通过页面公告向您告知。
为实现风控或合规目的，或为保护您的正当权益，特定情形下（例如账户下有相关待决纠纷）不支持您注销支付账户，请根据提示要求操作后再尝试注销。账户注销后将无法恢复使用，您在该账户内的所有信息也将无法恢复，我们将不会再收集、使用或共享与该账户相关的个人信息。但您的身份资料信息我们仍需按照监管要求的时间进行保存，且在该依法保存的时间内主管机关仍有权依法查询。如您发现我们采集、使用您个人信息的行为违反法律法规规定或违反与您的约定，或您发现我们采集、储存的您的个人信息有误，您可联系我们，要求予以必要的更正或删除。
4.3 尽管有上述约定，但按照法律法规要求，在以下情形下，我们可能无法响应您的请求：
（1）与国家安全、公共安全、重大公共利益相关的；
（2）与法院裁决或判决、或政府机关的强制性要求相关的；
（3）有充分证据表明您存在主观恶意或滥用权利的；
（4）响应您的请求将导致相关个人、组织的合法权益受到严重损害的。
我们对合理的请求原则上不收取费用，但对一定时期内多次重复的请求，可视情收取一定成本费用。</pre>
      </section>
      <section>
        <h2>五、未成年人保护我们的产品和服务只面向成人。请您确保您已满十八周岁并具有完全民事行为能力。</h2>
      </section>
      <section>
        <h2>
          六、对第三方责任的声明请您了解并注意，通过我们接入的第三方服务（如我们
          网站中第三方金融信息服务商或金融产品服务商提供的信息咨询、居间服务或贷
          款、借款服务）、您访问的第三方网站经营者等可能有自己的隐私权保护政策，
          该第三方可能会放置自己的 Cookie 或像素标签，且不受本政策的约束。请您与
          该第三方直接联系获取其隐私政策相关内容。我们尽力确保所有链接的第三方网
          站采用同等的个人信息保护措施，但是我们不对这些第三方网站上的活动、隐私
          权政策或隐私保护水平承担任何法律或其他责任。如果您发现该第三方在为您提
          供服务的过程中，其创建的网页或开发的应用程序存在风险，建议您终止相关操
          作以保护您的合法权益。
        </h2>
      </section>
      <section>
        <h2>七、隐私政策的修订</h2>
        <pre>
          本隐私政策将会随着我们的业务的发展进行更新，以便为您提供更好的服务。我们会通过指定官方渠道发出更新版本并在生效前通过公告或以其他的方式提醒您相关内容的更新，请您及时访问以便了解最新的隐私政策。
对于重大变更，我们还会提供更为显著的通知（包括对于某些服务，我们会通过弹窗的方式发送通知，说明隐私政策的具体变更内容）。
本政策所指的重大变更包括但不限于：
（1）本产品模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；
（2）我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；
（3）个人信息共享、转让或公开披露的主要对象发生变化；
（4）您参与个人信息处理方面的权利及其行使方式发生重大变化；
（5）我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；
（6）个人信息安全影响评估报告表明存在高风险时。
        </pre>
      </section>
      <section>
        <h2>八、如何联系我们</h2>
        <pre>
          如果您有任何的疑问、投诉、意见和建议，欢迎您与我们沟通反馈，我们将在15 天内回复您的请求。我们为此建立了个人信息保护的专职部门及负责人。如果您对我们的回复不满意，特别是您认为我们的个人信息处理行为损害了您的合法权益，您还可以通过向被告住所地有管辖权的法院提起诉讼来寻求解决方案。
        </pre>
      </section>
      <footer>
        <p>辽宁尚士华融法律咨询服务有限公司</p>
        <p>2024 年</p>
      </footer>
    </article>

    <!-- <canvas v-for="pageIndex in pdfPages" :id="`pdf-canvas-${pageIndex}`" :key="pageIndex" class="canvas-x" /> -->
  </div>
</template>

<style lang="less" scoped>
.pdf-container {
  width: 100%;
  height: 100%;
  .canvas-x {
    border: 1px solid #ddd;
  }
}

.img-wrapper {
  width: 222px;
  height: 80px;
  display: none;
  background: rgba(230, 54, 51, 0.2);

  .sign-picture {
    width: 222px;
    height: 80px;
  }
}

body {
  font-family: Arial, sans-serif;
  line-height: 1.6;
  margin: 0;
  padding: 0 16px;
  background-color: #f9f9f9;
  color: #333;
}

article {
  max-width: 800px;
  margin: 20px auto;
  padding: 20px;
  background: #fff;
  box-shadow: 0 2px 4px rgba(0, 0, 0, 0.1);
  border-radius: 8px;
}

h1 {
  font-size: 16px;
  text-align: left;
  margin-bottom: 20px;
}

h2 {
  font-size: 16px;
  margin-top: 20px;
  color: #555;
}

pre {
  margin-bottom: 16px;
  text-align: justify;
  white-space: pre-line;
}

footer {
  text-align: center;
  font-size: 8px;
  color: #777;
  p {
    font-size: 16px;
    text-align: right;
  }
}
</style>

<route lang="json">
{
    "name": "selfFile"
}
</route>
